app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.all.order(created_at: 'desc').page(params[:page]).per(10)

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "g"], ["created_at", "2020-08-01 04:08:49.440644"], ["updated_at", "2020-08-01 04:08:49.440644"], ["user_id", 2]]
---
  def create
    @post = Post.new(
      content: params[:content],
      user_id: @current_user.id
    )
      if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "1編集良い良い"], ["updated_at", "2020-07-30 09:22:36.685469"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(params_permit)