app/controllers/users_controller.rb

  def index
    @users = User.all.page(params[:page]).per(10)
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(params_permit)
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?, ?)  [["name", "new"], ["email", "new@gmail.com"], ["created_at", "2020-07-31 17:54:22.265543"], ["updated_at", "2020-07-31 17:54:22.265543"], ["password", "new"]]

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "test23"], ["email", "test23"], ["updated_at", "2020-08-01 10:42:31.575647"], ["id", 3]]